app/controllers/funcionarios_controller.rb

  def index
    @funcionarios = Funcionario.all
---
SELECT "funcionarios".* FROM "funcionarios"

  def create
    @funcionario = Funcionario.new(funcionario_params)

    respond_to do |format|
      if @funcionario.save
---
INSERT INTO "funcionarios" ("matricula", "nome", "endereco", "telefone", "salario", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @funcionario.update(funcionario_params)
---
UPDATE "funcionarios" SET "matricula" = ?, "dtadmissao" = ?, "updated_at" = ? WHERE "funcionarios"."id" = ?  [["matricula", "201411200021___"], ["dtadmissao", "2015-01-12"], ["updated_at", "2015-11-23 18:12:26.227412"], ["id", 1]]

    def set_funcionario
      @funcionario = Funcionario.find(params[:id])
---
SELECT  "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = ? LIMIT 1  [["id", 1]]